const kata = require('../kata');

describe("Текстовый калькулятор суммирующий числа из строки", ()=> {
    it("return 0 from empty string",()=>{
        expect(kata("")).toBe(0);
    });

    it("вернет сумму чисел 1 и 8",()=>{
        expect(kata("1,8")).toBe(9);
    });

    it("вернет сумму чисел 1, 4 ,6 ,8 ,10",()=>{
        expect(kata("1,4,6,8,10")).toBe(29);
    });

    it("Вернет сумму чисел расположенных на разных строках",()=>{
        expect(kata("6,\n7,9,\n12")).toBe(34);
    });

    it("Вернет сумму с иным разделителем указанным на первой строке после //",()=>{
        expect(kata("//;\n2;3;4;\n8")).toBe(17);
    });

    it("Разделитель любой длины",()=>{
        expect(kata("//><;:\n2><;:5><;:4><;:\n8")).toBe(19);
    });
    it("Разделитель всякий",()=>{
        expect(kata("//[*sdfssdf][%]\n1*sdfssdf12%3")).toBe(16);
    });
    it("Выбросит ошибку из-за отрицательных чисел",()=>{
        expect(()=>kata("-8,7")).toThrow("negatives not allowed -8");
    });

    it("покажет все отрицательные числа",()=>{
        expect(()=>kata("-8,-9, 12, -5")).toThrow("negatives not allowed -8,-9,-5");
    });

    it("Все сразу )",()=>{
        expect(()=>kata("//;\n2;3;-4;\n-8")).toThrow("negatives not allowed -4,-8");
    });
    it("более 1000 не считать )",()=>{
        expect(kata("1,2,3,1001")).toBe(6);
    });

});